dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f72x_pinmux.h
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PE12) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == SAI2_SCK_B_FUNC          )) ? 10 : \
	((gpio == PE12) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PE12) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PE13) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE13) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PE13) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PE14) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PE14) && (func == FMC_DA11_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == FMC_D12_FUNC             )) ? 12 : \
	((gpio == PE15) && (func == FMC_DA12_FUNC            )) ? 12 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == FMC_A0_FUNC              )) ? 12 : \
	((gpio == PF01) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF01) && (func == FMC_A1_FUNC              )) ? 12 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == FMC_A2_FUNC              )) ? 12 : \
	((gpio == PF03) && (func == FMC_A3_FUNC              )) ? 12 : \
	((gpio == PF04) && (func == FMC_A4_FUNC              )) ? 12 : \
	((gpio == PF05) && (func == FMC_A5_FUNC              )) ? 12 : \
	((gpio == PF06) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PF06) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ?  6 : \
	((gpio == PF06) && (func == UART7_RX_FUNC            )) ?  8 : \
	((gpio == PF06) && (func == QUADSPI_BK1_IO3_FUNC     )) ?  9 : \
	((gpio == PF07) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PF07) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ?  6 : \
	((gpio == PF07) && (func == UART7_TX_FUNC            )) ?  8 : \
	((gpio == PF07) && (func == QUADSPI_BK1_IO2_FUNC     )) ?  9 : \
	((gpio == PF08) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ?  6 : \
	((gpio == PF08) && (func == UART7_DE_FUNC            )) ?  8 : \
	((gpio == PF08) && (func == UART7_RTS_FUNC           )) ?  8 : \
	((gpio == PF08) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PF08) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PF09) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ?  6 : \
	((gpio == PF09) && (func == UART7_CTS_FUNC           )) ?  8 : \
	((gpio == PF09) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PF09) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PF11) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF11) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PF11) && (func == FMC_SDNRAS_FUNC          )) ? 12 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PG00) && (func == FMC_A10_FUNC             )) ? 12 : \
	((gpio == PG01) && (func == FMC_A11_FUNC             )) ? 12 : \
	((gpio == PG02) && (func == FMC_A12_FUNC             )) ? 12 : \
	((gpio == PG03) && (func == FMC_A13_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == FMC_A14_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == FMC_BA0_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == FMC_A15_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == FMC_BA1_FUNC             )) ? 12 : \
	((gpio == PG07) && (func == USART6_CK_FUNC           )) ?  8 : \
	((gpio == PG07) && (func == FMC_INT_FUNC             )) ? 12 : \
	((gpio == PG08) && (func == USART6_DE_FUNC           )) ?  8 : \
	((gpio == PG08) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG08) && (func == FMC_SDCLK_FUNC           )) ? 12 : \
	((gpio == PG09) && (func == USART6_RX_FUNC           )) ?  8 : \
	((gpio == PG09) && (func == QUADSPI_BK2_IO2_FUNC     )) ?  9 : \
	((gpio == PG09) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PG09) && (func == SDMMC2_D0_FUNC           )) ? 11 : \
	((gpio == PG09) && (func == FMC_NCE_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == FMC_NE2_FUNC             )) ? 12 : \
	((gpio == PG10) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PG10) && (func == SDMMC2_D1_FUNC           )) ? 11 : \
	((gpio == PG10) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG11) && (func == SDMMC2_D2_FUNC           )) ? 10 : \
	((gpio == PG11) && (func == FMC_INT_FUNC             )) ? 12 : \
	((gpio == PG12) && (func == LPTIM1_IN1_FUNC          )) ?  3 : \
	((gpio == PG12) && (func == USART6_DE_FUNC           )) ?  8 : \
	((gpio == PG12) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG12) && (func == SDMMC2_D3_FUNC           )) ? 11 : \
	((gpio == PG12) && (func == FMC_NE4_FUNC             )) ? 12 : \
	((gpio == PG13) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PG13) && (func == LPTIM1_OUT_FUNC          )) ?  3 : \
	((gpio == PG13) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG13) && (func == FMC_A24_FUNC             )) ? 12 : \
	((gpio == PG14) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PG14) && (func == LPTIM1_ETR_FUNC          )) ?  3 : \
	((gpio == PG14) && (func == USART6_TX_FUNC           )) ?  8 : \
	((gpio == PG14) && (func == QUADSPI_BK2_IO3_FUNC     )) ?  9 : \
	((gpio == PG14) && (func == FMC_A25_FUNC             )) ? 12 : \
	((gpio == PG15) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG15) && (func == FMC_SDNCAS_FUNC          )) ? 12 : \
	((gpio == PH02) && (func == LPTIM1_IN2_FUNC          )) ?  3 : \
	((gpio == PH02) && (func == QUADSPI_BK2_IO0_FUNC     )) ?  9 : \
	((gpio == PH02) && (func == SAI2_SCK_B_FUNC          )) ? 10 : \
	((gpio == PH02) && (func == FMC_SDCKE0_FUNC          )) ? 12 : \
	((gpio == PH03) && (func == QUADSPI_BK2_IO1_FUNC     )) ?  9 : \
	((gpio == PH03) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PH03) && (func == FMC_SDNE0_FUNC           )) ? 12 : \
	((gpio == PH04) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PH04) && (func == USB_OTG_HS_ULPI_NXT_FUNC )) ? 10 : \
	((gpio == PH05) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PH05) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PH05) && (func == FMC_SDNWE_FUNC           )) ? 12 : \
	((gpio == PH06) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PH06) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PH06) && (func == TIM12_CH1_FUNC           )) ?  9 : \
	((gpio == PH06) && (func == FMC_SDNE1_FUNC           )) ? 12 : \
	((gpio == PH07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PH07) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PH07) && (func == FMC_SDCKE1_FUNC          )) ? 12 : \
	((gpio == PH08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PH08) && (func == FMC_D16_FUNC             )) ? 12 : \
	((gpio == PH09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PH09) && (func == TIM12_CH2_FUNC           )) ?  9 : \
	((gpio == PH09) && (func == FMC_D17_FUNC             )) ? 12 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == FMC_D18_FUNC             )) ? 12 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == FMC_D19_FUNC             )) ? 12 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == FMC_D20_FUNC             )) ? 12 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PH13) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PH13) && (func == FMC_D21_FUNC             )) ? 12 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PH14) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PH14) && (func == FMC_D22_FUNC             )) ? 12 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == FMC_D23_FUNC             )) ? 12 : \
	((gpio == PI00) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PI00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PI00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PI00) && (func == FMC_D24_FUNC             )) ? 12 : \
	((gpio == PI01) && (func == TIM8_BKIN2_FUNC          )) ?  3 : \
	((gpio == PI01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PI01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PI01) && (func == FMC_D25_FUNC             )) ? 12 : \
	((gpio == PI02) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PI02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PI02) && (func == FMC_D26_FUNC             )) ? 12 : \
	((gpio == PI03) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PI03) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PI03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PI03) && (func == FMC_D27_FUNC             )) ? 12 : \
	((gpio == PI04) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PI04) && (func == SAI2_MCLK_A_FUNC         )) ? 10 : \
	((gpio == PI04) && (func == FMC_NBL2_FUNC            )) ? 12 : \
	((gpio == PI05) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PI05) && (func == SAI2_SCK_A_FUNC          )) ? 10 : \
	((gpio == PI05) && (func == FMC_NBL3_FUNC            )) ? 12 : \
	((gpio == PI06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PI06) && (func == SAI2_SD_A_FUNC           )) ? 10 : \
	((gpio == PI06) && (func == FMC_D28_FUNC             )) ? 12 : \
	((gpio == PI07) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PI07) && (func == SAI2_FS_A_FUNC           )) ? 10 : \
	((gpio == PI07) && (func == FMC_D29_FUNC             )) ? 12 : \
	((gpio == PI09) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PI09) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PI09) && (func == FMC_D30_FUNC             )) ? 12 : \
	((gpio == PI10) && (func == FMC_D31_FUNC             )) ? 12 : \
	((gpio == PI11) && (func == USB_OTG_HS_ULPI_DIR_FUNC )) ? 10 : \
	AF_NO_SUCH_PINFUNC)

